<?php
// №1 Створення базового PHP-скрипта
// Виводимо на екран текст Hello, World!
echo "Hello, World!<br>";

// №2 Змінні та типи даних
// Оголошуємо змінні різних типів
$stringVar = "Це рядок"; // рядок 
$intVar = 35; // ціле число 
$floatVar = 15.5; // число з плаваючою комою 
$boolVar = true; // булеве значення 

// Виводимо значення змінних на екран
echo $stringVar . "<br>";
echo $intVar . "<br>";
echo $floatVar . "<br>";
echo $boolVar . "<br>";

// Виводимо тип кожної змінної
var_dump($stringVar);
echo "<br>";
var_dump($intVar);
echo "<br>";
var_dump($floatVar);
echo "<br>";
var_dump($boolVar);
echo "<br>";

// №3 Конкатенація рядків
// Створюємо дві змінні з рядковими значеннями
$string1 = "Hello";
$string2 = "World!";

// Об'єднуємо ці рядки та виводимо результат на екран
$concatenatedString = $string1 . " " . $string2;
echo $concatenatedString . "<br>";

// №4 Умовні конструкції
// Створюємо змінну з числовим значенням
$number = 5;

// Перевіряємо, чи є число парним або непарним
if ($number % 2 == 0) {
    echo "Число $number є парним.<br>";
} else {
    echo "Число $number є непарним.<br>";
}

// №5 Цикли
// Виводимо числа від 1 до 10 за допомогою циклу for
for ($i = 1; $i <= 10; $i++) {
    echo $i . " ";
}
echo "<br>";

// Виводимо числа від 10 до 1 за допомогою циклу while
$i = 10;
while ($i >= 1) {
    echo $i . " ";
    $i--;
}
echo "<br>";

// №6 Масиви
// Створюємо асоціативний масив з інформацією про студента
$student = [
    "ім'я" => "Данило",
    "прізвище" => "Кізілов",
    "вік" => 19,
    "спеціальність" => "UX/UIдизайнер"
];

// Виводимо значення кожного елемента масиву на екран
echo "Ім'я: " . $student["ім'я"] . "<br>";
echo "Прізвище: " . $student["прізвище"] . "<br>";
echo "Вік: " . $student["вік"] . "<br>";
echo "Спеціальність: " . $student["спеціальність"] . "<br>";

// Додаємо новий елемент до масиву
$student["середній бал"] = 4.2;

// Виводимо оновлений масив
echo "Середній бал: " . $student["середній бал"] . "<br>";
?>
